"""
Модуль gui хранит скрипты для работы с графической оболочкой серверной части
мессенджера. Создание элементов оконного интерфейса и интеграция бекэнд-процессов
в пользовательский функционал.

**Скрипты**

* register_client.py :
    формирование окна регистрации пользователей
* remove_client.py :
    формирование окна удаления пользователей
* server_gui.py :
    основная часть PyQT-дизайна главного окна серверной части
* server_window.py :
    формирование главного окна серверной части мессенджера и его функционала
"""
