"""
Модуль common содержит общие скрипты для работы клиентской и серверной частей мессенджера..

**Скрипты**

* decorators.py :
    содержит декораторы для расширения функционала классов (логирование)
* descriptors.py :
    содержит дескрипторы для придания атрибутам классов связанного поведения (валидация портов)
* errors.py :
    скрипт для собственных исключений
* metaclasses.py :
    скрипт с метаклассами, упорядочивающими поведение экземпляров классов (проверка на
    использование допустимых для классов методов, типа сокета и т.д.)
* parent_classfile.py :
    скрипт, содержащий код родительского класса объекта сокета, общий для сервера
    и клиента, имеющий общие для них методы получения и отправки данных
* vars.py :
    хранит условные константы, использующиеся в проекте
"""
